[IO_SlapHappy_ArmPlacement InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_MO_SlapHappy_HammerlockArm MissionItemDefinition]
UseFailureCharacterMessage="Must be %s To access this article."
ItemName="hand hammer"
PickupMessage="I understand %s"
UseFailureLevelMessage="You must have at least% d level to use this item.."
UseFailureConstraintsMessage="You cannot use this item."
NoManufacturerName="President"

[ItemDefs.ID_MO_SlapHappy_HammerlockArm:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Sailor's hand."
NoConstraintText=""
Suffix=""
Prefix=""

[ItemDefs.ID_MO_SlapHappy_HammerlockArmBait MissionItemDefinition]
UseFailureCharacterMessage="you want %s Using this feature."
ItemName="Hammer on the wrist"
PickupMessage="Like %s"
UseFailureLevelMessage="You must be %d or higher to use this feature."
UseFailureConstraintsMessage="You may not use this product.."
NoManufacturerName="Generally"

[ItemDefs.ID_MO_SlapHappy_HammerlockArmBait:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Soldier's legs."
NoConstraintText=""
Suffix=""
Prefix=""

